Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Returns the error text from the last MySQL function, or '' (the empty string) if no error occurred.
pt_br: Retorna o texto do erro da ultima função do MySQL, ou '' (Uma string vazia) se não houve erro.

source: Instead, use mysql_error() to retrieve the error text.
pt_br: Ao invés, use mysql_error() para obter o texto do erro.

source: Note that this function only returns the error text from the most recently executed MySQL function (not including mysql_error() and mysql_errno()), so if you want to use it, make sure you check the value before calling another MySQL function.
pt_br: Note que esta função somente retorna o texto de erro da ultima função do MySQL que foi executada( não incluindo mysql_error() e mysql_errno()), assim se você quer usa-la, tenha certeza de utiliza-la antes de chamar outra função do MySQL.

source: Example 1. mysql_error Example
pt_br: Exemplo mysql_error

source: If the optional argument is specified the given link is used to retrieve the error message.
pt_br: Se o argumento opcional é especificado, a conexão indicada é usada para obter o código de erro.

source: See also: mysql_errno()
pt_br: Veja também: mysql_errno()

source: This function will escape the unescaped_string, so that it is safe to place it in a mysql_query().
pt_br: Esta função irá escapar o unescaped_string, assim será seguro coloca-la na função mysql_query().

source: This function is identical to mysql_real_escape_string() except that mysql_real_escape_string() takes a connection handler and escapes the string according to the current character set. mysql_escape_string() does not take a connection argument and does not respect the current charset setting.
pt_br: Esta função é identica a mysql_real_escape_string() exceto que mysql_real_escape_string() precisa de um identificador de conexão e escapa a string de acordo com o conjunto atual de caracteres atual. mysql_escape_string() não precisa de um identificador de conexão e não respeita o conjunto atual de caracteres.

source: Example 1. mysql_escape_string() example
pt_br: Exemplo mysql_escape_string()

source: ?php $item = "Zak's Laptop"; $escaped_item = mysql_escape_string($item); printf ("Escaped string: %s\n", $escaped_item);?
pt_br: ?php $item = "Zak's Laptop"; $escaped_item = mysql_escape_string($item); printf ("String escapada: %s\n", $escaped_item);?

source: See also: mysql_real_escape_string(), addslashes(), and the magic_quotes_gpc directive.
pt_br: Veja também: mysql_real_escape_string(), addslashes(), e a diretiva magic_quotes_gpc.

source: Returns an array that corresponds to the fetched row, or FALSE if there are no more rows.
pt_br: Retorna uma matriz que corresponde a linha buscada, ou FALSE se não houverem mais linhas.

source: mysql_fetch_array() is an extended version of mysql_fetch_row().
pt_br: mysql_fetch_array() é uma versão estendida de mysql_fetch_row().

source: If two or more columns of the result have the same field names, the last column will take precedence.
pt_br: Se duas ou mais colunas do resultado tiverem o mesmo nome do campo, a ultima coluna terá precedência.

source: To access the other column( s) of the same name, you must use the numeric index of the column or make an alias for the column.
pt_br: Para acessar as outras coluna( s) com o mesmo nome, você deve usar o índice numérico da coluna ou fazer um apelido para a coluna.

source: For aliased columns, you cannot access the contents with the original column name (by using'field 'in this example).
pt_br: Para colunas com apelido, você não pode acessar os conteúdos com o nome original da coluna (usando 'field 'neste exemplo).

source: Query with duplicate field names
pt_br: Query com nomes de campo duplicados

source: An important thing to note is that using mysql_fetch_array() is not significantly slower than using mysql_fetch_row(), while it provides a significant added value.
pt_br: Uma coisa importante para notar é que usar mysql_fetch_array() não é significativamente mais lenta do que usar mysql_fetch_row(), enquanto que produz um resultado melhor de se usar.

source: The optional second argument result_type in mysql_fetch_array() is a constant and can take the following values:
pt_br: O segundo argumento, que é opcional, result_type em mysql_fetch_array() é uma constante que pode ter os seguintes valores:

source: MYSQL_ASSOC, MYSQL_NUM, and MYSQL_BOTH.
pt_br: MYSQL_ASSOC, MYSQL_NUM, e MYSQL_BOTH.

source: This feature was added in PHP 3.0.7.
pt_br: Isto foi adicionado no PHP 3.0.7.

source: MYSQL_BOTH is the default for this argument.
pt_br: MYSQL_BOTH é o padrão para este argumento.

source: By using MYSQL_BOTH, you 'll get an array with both associative and number indices.
pt_br: Usando MYSQL_BOTH, você terá uma matriz com os índices associativos e numéricos.

source: Using MYSQL_ASSOC, you only get associative indices (as mysql_fetch_assoc() works), using MYSQL_NUM, you only get number indices (as mysql_fetch_row() works).
pt_br: Usando MYSQL_ASSOC, você terá apenas os índices associativos (como funciona mysql_fetch_assoc()), usando MYSQL_NUM, você terá apenas os índices numéricos (como funciona mysql_fetch_row()).

source: Example 2. mysql_fetch_array with MYSQL_NUM
pt_br: Exemplo 2. mysql_fetch_array com MYSQL_NUM

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_NUM)) {printf ("ID: %s Name: %s", $row[0], $row[1]);} mysql_free_result($result);?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_NUM)) {printf ("ID: %s Name: %s", $row[0], $row[1]);} mysql_free_result($result);?

source: Example 3. mysql_fetch_array with MYSQL_ASSOC
pt_br: Exemplo 3. mysql_fetch_array com MYSQL_ASSOC

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_ASSOC)) {printf ("ID: %s Name: %s", $row["id"], $row["name"]);} mysql_free_result($result);?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_ASSOC)) {printf ("ID: %s Name: %s", $row["id"], $row["name"]);} mysql_free_result($result);?

source: Example 4. mysql_fetch_array with MYSQL_BOTH
pt_br: Exemplo 4. mysql_fetch_array com MYSQL_BOTH

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_BOTH)) {printf ("ID: %s Name: %s", $row[0], $row["name"]);} mysql_free_result($result);?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); mysql_select_db("mydb"); $result = mysql_query("SELECT id, name FROM mytable"); while ($row = mysql_fetch_array($result, MYSQL_BOTH)) {printf ("ID: %s Name: %s", $row[0], $row["name"]);} mysql_free_result($result);?

source: For further details, see also mysql_fetch_row() and mysql_fetch_assoc().
pt_br: Para maiores detalhes, veja também mysql_fetch_row() e mysql_fetch_assoc().

source: Returns an associative array that corresponds to the fetched row, or FALSE if there are no more rows.
pt_br: Retorna uma matriz associativa que corresponde a linha ou FALSE se não houverem mais linhas.

source: mysql_fetch_assoc() is equivalent to calling mysql_fetch_array() with MYSQL_ASSOC for the optional second parameter.
pt_br: mysql_fetch_assoc() é equivalente a chamar mysql_fetch_array() com MYSQL_ASSOC para o segundo parâmetro, que é opcional.

source: It only returns an associative array.
pt_br: Somente retorna uma matriz associativa.

source: This is the way mysql_fetch_array() originally worked.
pt_br: Este é o jeito que mysql_fetch_array() funcionava originalmente.

source: If you need the numeric indices as well as the associative, use mysql_fetch_array().
pt_br: Se você precisa dos índices numéricos assim como o associativo, use mysql_fetch_array().

source: To access the other column( s) of the same name, you either need to access the result with numeric indices by using mysql_fetch_row() or add alias names.
pt_br: Para acessar as outras coluna( s) com o mesmo nome, você deve usar o índice numérico da coluna usando mysql_fetch_row() ou fazer um apelido para a coluna.

source: See the example at the mysql_fetch_array() description about aliases.
pt_br: Veja o exemplo em mysql_fetch_array() uma descrição para apelidos.

source: An expanded mysql_fetch_assoc() example
pt_br: Exemplo 1. mysql_fetch_assoc()

source: ?php $conn = mysql_connect( "localhost", "mysql_user", "mysql_password"); if (!$conn) {echo "Unable to connect to DB: ". mysql_error(); exit;} if (!mysql_select_db("mydbname")) {echo "Unable to select mydbname:". mysql_error(); exit;} $sql = "SELECT id as userid, fullname, userstatus FROM sometable WHERE userstatus = 1"; $result = mysql_query($sql); if (!$result) {echo "Could not successfully run query ($sql) from DB: ". mysql_error(); exit;} if (mysql_num_rows($result) == 0) {echo "No rows found, nothing to print so am exiting"; exit;} / / While a row of data exists, put that row in $row as an associative array / / Note:
pt_br: ?php $conn = mysql_connect( "localhost", "mysql_user", "mysql_password"); if (!$conn) {echo "Não foi possível conectar: ". mysql_error(); exit;} if (!mysql_select_db("mydbname")) {echo "Não foi possível selecionar mydbname:". mysql_error(); exit;} $sql = "SELECT id as userid, fullname, userstatus FROM sometable WHERE userstatus = 1"; $result = mysql_query($sql); if (!$result) {echo "Não foi possível executar a query ($sql): ". mysql_error(); exit;} if (mysql_num_rows($result) == 0) {echo "Nenhuma linha encontrada, nada para mostrar, então estou saindo"; exit;} / / Enquanto uma linha com dados existir, coloca esta linha em $row como uma matriz associativa / / Nota:

source: If you 're expecting just one row, no need to use a loop / / Note:
pt_br: Se você esta esperando somente uma linha, não é necessário usar o loop / / Note:

source: If you put extract( $row); inside the following loop, you'll / / then create $userid, $fullname, and $userstatus while ($row = mysql_fetch_assoc($result)) {echo $row["userid"]; echo $row["fullname"]; echo $row["userstatus"];} mysql_free_result($result);?
pt_br: Se você colocar extract( $row); dentro o loop a seguir, / / então você irá criar $userid, $fullname, and $userstatus while ($row = mysql_fetch_assoc($result)) {echo $row["userid"]; echo $row["fullname"]; echo $row["userstatus"];} mysql_free_result($result);?

source: See also mysql_fetch_row(), mysql_fetch_array(), mysql_query(), and mysql_error().
pt_br: Para maiores detalhes, veja também mysql_fetch_row(), mysql_fetch_array() e mysql_query().

source: mysql_fetch_field() can be used in order to obtain information about fields in a certain query result.
pt_br: mysql_fetch_field() pode ser usado para obter informações sobre os campos num certo resultado de uma query.

source: If the field offset isn' t specified, the next field that wasn't yet retrieved by mysql_fetch_field() is retrieved.
pt_br: Se o índice do campo não é especificado, o próximo campo que não foi ainda retornado por mysql_fetch_field() é retornado.

source: name - column name
pt_br: name - nome da coluna

source: table - name of the table the column belongs to
pt_br: table - nome da tabela onde esta o campo

source: not_null - 1 if the column cannot be NULL
pt_br: not_null - 1 se a coluna não pode ser NULL

source: primary_key - 1 if the column is a primary key
pt_br: primary_key - 1 se a coluna é a chave primária

source: unique_key - 1 if the column is a unique key
pt_br: unique_key - 1 se a coluna é a chave única

source: multiple_key - 1 if the column is a non-unique key
pt_br: multiple_key - 1 se a coluna é uma chave não única

source: blob - 1 if the column is a BLOB
pt_br: blob - 1 se a coluna é BLOB

source: type - the type of the column
pt_br: type - o tipo da coluna

source: unsigned - 1 if the column is unsigned
pt_br: unsigned - 1 se a coluna é unsigned( sem sinal)

source: zerofill - 1 if the column is zero-filled
pt_br: zerofill - 1 se a coluna é preenchida com zero

source: Example 1. mysql_fetch_field()
pt_br: Exemplo 1. mysql_fetch_field()

source: ?php mysql_connect( 'localhost:3306', $user, $password) or die("Could not connect: ". mysql_error()); mysql_select_db("database"); $result = mysql_query("select * from table") or die("Query failed:". mysql_error()); / * get column metadata * / $i = 0; while ($i mysql_num_fields($result)) {echo "Information for column $i: br / \n"; $meta = mysql_fetch_field($result); if (!$meta) {echo "No information available br / \n";} echo "pre blob: $meta - blob max_length: $meta - max_length multiple_key: $meta - multiple_key name: $meta - name not_null: $meta - not_null numeric: $meta - numeric primary_key: $meta - primary_key table: $meta - table type: $meta - type unique_key: $meta - unique_key unsigned: $meta - unsigned zerofill: $meta - zerofill / pre"; $i++;} mysql_free_result($result);?
pt_br: ?php mysql_connect( 'localhost:3306', $user, $password) or die ("Não pude conectar: ". mysql_error()); mysql_select_db("database"); $result = mysql_query("select * from table") or die("A query falhou:". mysql_error()); / * get column metadata * / $i = 0; while ($i mysql_num_fields($result)) {echo "Informação para a coluna $i: br / \n"; $meta = mysql_fetch_field($result); if (!$meta) {echo "Informação não disponivel br / \n";} echo "pre blob: $meta - blob max_length: $meta - max_length multiple_key: $meta - multiple_key name: $meta - name not_null: $meta - not_null numeric: $meta - numeric primary_key: $meta - primary_key table: $meta - table type: $meta - type unique_key: $meta - unique_key unsigned: $meta - unsigned zerofill: $meta - zerofill / pre"; $i++;} mysql_free_result($result);?

source: See also mysql_field_seek().
pt_br: Veja também mysql_field_seek().

source: Returns an array that corresponds to the lengths of each field in the last row fetched by mysql_fetch_row(), or FALSE on error.
pt_br: Retorna uma matriz que corresponte ao tamanho de cada campo na ultima coluna retornada por mysql_fetch_row(), ou FALSE se houver erro.

source: mysql_fetch_lengths() stores the lengths of each result column in the last row returned by mysql_fetch_row(), mysql_fetch_array(), and mysql_fetch_object() in an array, starting at offset 0.
pt_br: mysql_fetch_lengths() guarda o tamanho de cada coluna do resultado retornado por mysql_fetch_row(), mysql_fetch_array(), e mysql_fetch_object() numa matriz, com o índice começando em 0.

source: See also: mysql_fetch_row().
pt_br: Veja também: mysql_fetch_row().

source: Returns an object with properties that correspond to the fetched row, or FALSE if there are no more rows.
pt_br: Retorna um objeto com propriedades que correspondem a linha, ou FALSE se não houverem mais linhas.

source: mysql_fetch_object() is similar to mysql_fetch_array(), with one difference - an object is returned, instead of an array.
pt_br: mysql_fetch_object() é similar a mysql_fetch_array(), com uma diferença - um objeto é retornado ao invés de uma matriz.

source: ?php / * this is valid * / echo $row - field; / * this is invalid * / echo $row - 0;?
pt_br: ?php / * Isto é válido * / echo $row - field; / * Isto é inválido * / echo $row - 0;?

source: Speed-wise, the function is identical to mysql_fetch_array(), and almost as quick as mysql_fetch_row() (the difference is insignificant).
pt_br: Em velocidade, a função é identica a mysql_fetch_array(), e quase tão rapida quanto mysql_fetch_row() (a diferença é insignificante).

source: Example 1. mysql_fetch_object() example
pt_br: Exemplo mysql_fetch_object()

source: See also: mysql_fetch_array() and mysql_fetch_row().
pt_br: Veja também: mysql_fetch_array() e mysql_fetch_row().

source: mysql_fetch_row() fetches one row of data from the result associated with the specified result identifier.
pt_br: mysql_fetch_row() retorna os dados de uma linha do resultado identificado por result(resultado de uma query).

source: Subsequent call to mysql_fetch_row() would return the next row in the result set, or FALSE if there are no more rows.
pt_br: A próxima chamada a mysql_fetch_row() irá retornar a próxima linha do conjunto de resultados, ou FALSE se não houverem mais linhas.

source: See also: mysql_fetch_array(), mysql_fetch_object(), mysql_data_seek(), mysql_fetch_lengths(), and mysql_result().
pt_br: Veja também: mysql_fetch_array(), mysql_fetch_object(), mysql_data_seek(), mysql_fetch_lengths(), e mysql_result().

source: mysql_field_flags() returns the field flags of the specified field.
pt_br: mysql_field_flags() retorna as flags do campo especificado.

source: The flags are reported as a single word per flag separated by a single space, so that you can split the returned value using explode().
pt_br: As flags são retornadas como uma única palavra separadas por um único espaço, assim você pode separar o valor retornado com explode().

source: The following flags are reported, if your version of MySQL is current enough to support them: "not_null", "primary_key", "unique_key", "multiple_key", "blob", "unsigned", "zerofill", "binary", "enum", "auto_increment", "timestamp".
pt_br: As seguintes flags são retornadas, se a sua versão do MySQL é atual o suficiente para reporta-las: "not_null", "primary_key", "unique_key", "multiple_key", "blob", "unsigned", "zerofill", "binary", "enum", "auto_increment", "timestamp".

source: For downward compatibility mysql_fieldflags() can also be used.
pt_br: Para compatibilidade com as versões anteriores mysql_fieldflags() também pode ser usada.

source: mysql_field_len() returns the length of the specified field.
pt_br: mysql_field_len() retorna o tamanho do campo especificado.

source: For downward compatibility mysql_fieldlen() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_fieldlen() pode também ser usada.

source: mysql_field_name() returns the name of the specified field index. result must be a valid result identifier and field_index is the numerical offset of the field.
pt_br: mysql_field_name() retorna o nome do campo do índice especificado. result deve ser um identificador de resultado(de uma query) valido e field_index é o índice do campo.

source: e.g.
pt_br: Dica.

source: The index of the third field would actually be 2, the index of the fourth field would be 3 and so on.
pt_br: O índice do terceiro campo deve ser 2, o índice do quarto campo deve ser 3 e assim em diante.

source: Example 1. mysql_field_name() example
pt_br: Exemplo mysql_field_name()

source: /* The users table consists of three fields: * user_id * username * password. * / $link = mysql_connect( 'localhost', "mysql_user", "mysql_password"); mysql_select_db($dbname, $link) or die("Could not set $dbname: ". mysql_error()); $res = mysql_query("select * from users", $link); echo mysql_field_name($res, 0). "\n"; echo mysql_field_name($res, 2);
pt_br: /* A tabela users consiste de três campos: * user_id * username * password. * / $link = mysql_connect( 'localhost', "mysql_user", "mysql_password"); mysql_select_db($dbname, $link) or die("Could not set $dbname: ". mysql_error()); $res = mysql_query("select * from users", $link); echo mysql_field_name($res, 0). "\n"; echo mysql_field_name($res, 2);

source: For downwards compatibility mysql_fieldname() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_fieldname() também pode ser usada.

source: If the next call to mysql_fetch_field() doesn't include a field offset, the field offset specified in mysql_field_seek() will be returned.
pt_br: Se a próxima chamada a mysql_fetch_field() não incluir um índice do campo, o índice especificado em mysql_field_seek() será retornado.

source: See also: mysql_fetch_field().
pt_br: Veja também: mysql_fetch_field().

source: Returns the name of the table that the specifed field is in.
pt_br: Retorna o nome da tabela onde esta o campo especificado.

source: For downward compatibility mysql_fieldtable() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_fieldtable() também pode ser usada.

source: mysql_field_type() is similar to the mysql_field_name() function.
pt_br: mysql_field_type() é similar a mysql_field_name().

source: The arguments are identical, but the field type is returned instead.
pt_br: Os argumentos são identicos, mas ao invés é retornado o tipo do campo.

source: The field type will be one of "int", "real", "string", "blob", and others as detailed in the MySQL documentation.
pt_br: O tipo do campo será um de "int", "real", "string", "blob", e outros detalhados na documentação do MySQL.

source: MySQL field types
pt_br: Tipos de campo do MySQL

source: For downward compatibility mysql_fieldtype() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_fieldtype() também pode ser usada.

source: mysql_free_result() will free all memory associated with the result identifier result.
pt_br: mysql_free_result() irá liberar toda a memória usada com o identificador de resultado result.

source: mysql_free_result() only needs to be called if you are concerned about how much memory is being used for queries that return large result sets.
pt_br: mysql_free_result() somente precisa ser chamado se você esta preocupado em quanta memória esta sendo usada para query num grande conjunto de resultados.

source: All associated result memory is automatically freed at the end of the script 's execution.
pt_br: Toda a memória usada do resultado é liberada automaticamente ao final da execução do script.

source: For downward compatibility mysql_freeresult() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_freeresult() também pode ser usada.

source: mysql_get_client_info() returns a string that represents the client library version.
pt_br: mysql_get_client_info() retorna uma string que representa a versão da biblioteca do cliente.

source: Example 1. mysql_get_client_info Example
pt_br: Exemplo mysql_get_client_info

source: See also: mysql_get_host_info(), mysql_get_proto_info() and mysql_get_server_info().
pt_br: Veja também: mysql_get_host_info(), mysql_get_proto_info() e mysql_get_server_info().

source: mysql_get_host_info() returns a string describing the type of connection in use for the connection link_identifier, including the server host name.
pt_br: mysql_get_host_info() retorna uma string descrevendo o tipo de conexão em uso para a conexão link_identifier, incluindo o nome de host do servidor.

source: If link_identifier is omitted, the last opened connection will be used.
pt_br: Se o parâmetro link_identifier é omitido, a ultima conexão aberta é usada.

source: Example 1. mysql_get_host_info Example
pt_br: Exemplo mysql_get_host_info

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); printf ("MySQL host info: %s\n", mysql_get_host_info());?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); printf ("MySQL host info: %s\n", mysql_get_host_info());?
